NOVA-RICS-Open-Lab/FMS/src/Arduino/boards package/industrialshields/hardware/avr/1.1.46/variants/mduinoplus/pins_arduino.h
#elif defined(MDUINO_57R_PLUS) || defined(MDUINO_38R_PLUS) || defined(MDUINO_54ARA_PLUS) || \
	defined(MDUINO_53ARR_PLUS) || defined(MDUINO_50RRA_PLUS) || defined(MDUINO_38AR_PLUS)
#define PIN_Q1_0		(8)
#define PIN_Q1_1		(9)
#define PIN_Q1_2		(7)
static const uint8_t Q1_0 = PIN_Q1_0;
static const uint8_t Q1_1 = PIN_Q1_1;
static const uint8_t Q1_2 = PIN_Q1_2;
#endif

#if defined(MDUINO_58_PLUS) || defined(MDUINO_54ARA_PLUS) || defined(MDUINO_50RRA_PLUS)
#define PIN_Q2_0		(53)
#define PIN_Q2_1		(47)
#define PIN_Q2_2		(48)
#define PIN_Q2_3		(49)
static const uint8_t Q2_0 = PIN_Q2_0;
static const uint8_t Q2_1 = PIN_Q2_1;
static const uint8_t Q2_2 = PIN_Q2_2;
static const uint8_t Q2_3 = PIN_Q2_3;

#if !defined(MDUINO_LORA_PLUS) 
#define PIN_Q2_5		(12)
static const uint8_t Q2_5 = PIN_Q2_5;
#endif

#if !defined(MDUINO_LORA_PLUS) && !defined(MDUINO_WIFI_GPRS_PLUS)
#define PIN_Q2_6		(13)
static const uint8_t Q2_6 = PIN_Q2_6;
#endif

#elif (defined(MDUINO_57R_PLUS) || defined(MDUINO_57AAR_PLUS) || defined(MDUINO_53ARR_PLUS)) && !defined(MDUINO_LORA_PLUS)
#define PIN_Q2_0		(12)
static const uint8_t Q2_0 = PIN_Q2_0;

#if !defined(MDUINO_WIFI_GPRS_PLUS)
#define PIN_Q2_1		(13)
static const uint8_t Q2_1 = PIN_Q2_1;
#endif

#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO+ analog outputs

#if defined(MDUINO_58_PLUS) || defined(MDUINO_42_PLUS) || defined(MDUINO_21_PLUS) || \
	defined(MDUINO_53ARR_PLUS) || defined(MDUINO_57AAR_PLUS) || defined(MDUINO_54ARA_PLUS) || \
	defined(MDUINO_38AR_PLUS)
#define PIN_A0_5		PIN_Q0_5
#define PIN_A0_6		PIN_Q0_6
#define PIN_A0_7		PIN_Q0_7
static const uint8_t A0_5 = PIN_A0_5;
static const uint8_t A0_6 = PIN_A0_6;
static const uint8_t A0_7 = PIN_A0_7;
#elif defined(MDUINO_57R_PLUS) || defined(MDUINO_38R_PLUS) || defined(MDUINO_19R_PLUS) || \
	defined(MDUINO_50RRA_PLUS)
#define PIN_A0_0		(4)
#define PIN_A0_1		(5)
#define PIN_A0_2		(6)
static const uint8_t A0_0 = PIN_A0_0;
static const uint8_t A0_1 = PIN_A0_1;
static const uint8_t A0_2 = PIN_A0_2;
#endif

#if defined(MDUINO_58_PLUS) || defined(MDUINO_42_PLUS) || defined(MDUINO_57AAR_PLUS)
#define PIN_A1_5		PIN_Q1_5
#define PIN_A1_6		PIN_Q1_6
#define PIN_A1_7		PIN_Q1_7
static const uint8_t A1_5 = PIN_A1_5;
static const uint8_t A1_6 = PIN_A1_6;
static const uint8_t A1_7 = PIN_A1_7;

#elif defined(MDUINO_57R_PLUS) || defined(MDUINO_38R_PLUS) || defined(MDUINO_54ARA_PLUS) || \
	defined(MDUINO_53ARR_PLUS) || defined(MDUINO_50RRA_PLUS) || defined(MDUINO_38AR_PLUS)
#define PIN_A1_0		(8)
#define PIN_A1_1		(9)
#define PIN_A1_2		(7)
static const uint8_t A1_0 = PIN_A1_0;
static const uint8_t A1_1 = PIN_A1_1;
static const uint8_t A1_2 = PIN_A1_2;
#endif

#if (defined(MDUINO_58_PLUS) || defined(MDUINO_54ARA_PLUS) || defined(MDUINO_50RRA_PLUS)) && !defined(MDUINO_LORA_PLUS)
#define PIN_A2_5		PIN_Q2_5
static const uint8_t A2_5 = PIN_A2_5;

#if !defined (MDUINO_WIFI_GPRS_PLUS)
#define PIN_A2_6		PIN_Q2_6
static const uint8_t A2_6 = PIN_A2_6;
#endif

#elif (defined(MDUINO_57R_PLUS) || defined(MDUINO_57AAR_PLUS) || defined(MDUINO_53ARR_PLUS)) && !defined(MDUINO_LORA_PLUS)
#define PIN_A2_0		(12)
static const uint8_t A2_0 = PIN_A2_0;

#if !defined(MDUINO_WIFI_GPRS_PLUS)
#define PIN_A2_1		(13)
static const uint8_t A2_1 = PIN_A2_1;
#endif

#endif

#if defined(MDUINO_57R_PLUS) || defined(MDUINO_38R_PLUS) || defined(MDUINO_19R_PLUS) || \
	defined(MDUINO_50RRA_PLUS)
#define PIN_R0_1		(23)
#define PIN_R0_2		(22)
#define PIN_R0_3		(25)
#define PIN_R0_4		(24)
#define PIN_R0_5		(40)
#define PIN_R0_6		(39)
#define PIN_R0_7		(38)
#define PIN_R0_8		(37)
static const uint8_t R0_1 = PIN_R0_1;
static const uint8_t R0_2 = PIN_R0_2;
static const uint8_t R0_3 = PIN_R0_3;
static const uint8_t R0_4 = PIN_R0_4;
static const uint8_t R0_5 = PIN_R0_5;
static const uint8_t R0_6 = PIN_R0_6;
static const uint8_t R0_7 = PIN_R0_7;
static const uint8_t R0_8 = PIN_R0_8;
#endif

#if defined(MDUINO_57R_PLUS) || defined(MDUINO_38R_PLUS) || defined(MDUINO_54ARA_PLUS) || \
	defined(MDUINO_53ARR_PLUS) || defined(MDUINO_50RRA_PLUS) || defined(MDUINO_38AR_PLUS)
#define PIN_R1_1		(28)
#define PIN_R1_2		(27)
#define PIN_R1_3		(30)
#define PIN_R1_4		(29)
#define PIN_R1_5		(45)
#define PIN_R1_6		(44)
#define PIN_R1_7		(43)
#define PIN_R1_8		(42)
static const uint8_t R1_1 = PIN_R1_1;
static const uint8_t R1_2 = PIN_R1_2;
static const uint8_t R1_3 = PIN_R1_3;
static const uint8_t R1_4 = PIN_R1_4;
static const uint8_t R1_5 = PIN_R1_5;
static const uint8_t R1_6 = PIN_R1_6;
static const uint8_t R1_7 = PIN_R1_7;
static const uint8_t R1_8 = PIN_R1_8;
#endif

#if defined(MDUINO_57R_PLUS) || defined(MDUINO_57AAR_PLUS) || defined(MDUINO_53ARR_PLUS)
#define PIN_R2_1		(33)
#define PIN_R2_2		(32)
#define PIN_R2_3		(35)
#define PIN_R2_4		(34)
#define PIN_R2_6		(49)
#define PIN_R2_7		(48)
#define PIN_R2_8		(47)
static const uint8_t R2_1 = PIN_R2_1;
static const uint8_t R2_2 = PIN_R2_2;
static const uint8_t R2_3 = PIN_R2_3;
static const uint8_t R2_4 = PIN_R2_4;
static const uint8_t R2_6 = PIN_R2_6;
static const uint8_t R2_7 = PIN_R2_7;
static const uint8_t R2_8 = PIN_R2_8;
#endif

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO+ RS-485
#define HAVE_RS485
#define HAVE_RS485_HARD
#define RS485_HWSERIAL 3
#define RS485_DE				(46)
#define RS485_RE				(11)

// Industrial Shields by Boot&Work Corp., S.L.
// Mapping: Arduino pins to M-DUINO RS-232
#define HAVE_RS232
#define HAVE_RS232_HARD
#define RS232_HWSERIAL 2

// GPRS module
#if defined(MDUINO_GPRS_PLUS) 
#define HAVE_SIM800L
#define HAVE_SIM800L_HARD
#define SIM800L_HWSERIAL (1)
#define SIM800L_RATE 57600UL
#define SIM800L_RESET_PIN (2)
#elif defined(MDUINO_WIFI_GPRS_PLUS)
#define HAVE_SIM800L
#define HAVE_SIM800L_HARD
#define SIM800L_HWSERIAL (2)
#define SIM800L_RATE 57600UL
#define SIM800L_RESET_PIN (13)
#endif

// WiFi module
#if defined(MDUINO_WIFI_PLUS) || defined(MDUINO_WIFI_GPRS_PLUS)
#define HAVE_ESP32
#define HAVE_ESP32_HARD
#define ESP32_HWSERIAL 1
#endif

// LoRa module
#if defined(MDUINO_LORA_PLUS)
#define HAVE_RFM9X
#define RFM9X_RESET_PIN (13)
#define RFM9X_SS_PIN (12)
#define RFM9X_INT_PIN (2)
#endif

